library(dplyr)
library(readxl)
library(writexl)


# Reading the Excel file
file_path <- './data/Bigdata/multi_merged.xlsx'
df <- read_excel(file_path)

# Processing missing data
df <- df %>%
  mutate(尿_白细胞 = ifelse(尿_白细胞数据缺失 == 1, NA, 尿_白细胞正常),
         尿_亚硝酸盐 = ifelse(尿_亚硝酸盐数据缺失 == 1, NA, 尿_亚硝酸盐正常),
         尿_蛋白质 = ifelse(尿_蛋白质数据缺失 == 1, NA, 尿_蛋白质盐正常),
         尿_酮体 = ifelse(尿_酮体盐数据缺失 == 1, NA, 尿_酮体正常),
         尿_尿胆原 = ifelse(尿_尿胆原数据缺失 == 1, NA, 尿_尿胆原正常),
         尿_胆红素 = ifelse(尿_胆红素数据缺失 == 1, NA, 尿_胆红素正常),
         粪_粪粘度 = ifelse(粪_粪粘度数据缺失 == 1, NA, 粪_粪粘度正常),
         粪_粪血液 = ifelse(粪_粪血液数据缺失 == 1, NA, 粪_粪血液正常),
         粪_粪不消化食物 = ifelse(粪_粪不消化食物数据缺失 == 1, NA, 粪_粪不消化食物正常),
         粪_粪红细胞 = ifelse(粪_粪红细胞数据缺失 == 1, NA, 粪_粪红细胞正常),
         粪_粪白细胞 = ifelse(粪_粪白细胞数据缺失 == 1, NA, 粪_粪白细胞正常),
         粪_粪巨噬细胞 = ifelse(粪_粪硬度数据缺失 == 1, NA, 粪_粪硬度正常),
         粪_粪硬度 = ifelse(尿_亚硝酸盐数据缺失 == 1, NA, 尿_亚硝酸盐正常),
         粪_粪颜色 = ifelse(粪_粪颜色数据缺失 == 1, NA, 粪_粪颜色正常),
         粪_粪隐血 = ifelse(粪_粪隐血数据缺失 == 1, NA, 粪_粪隐血正常),
         粪_粪转铁蛋白 = ifelse(粪_粪转铁蛋白数据缺失 == 1, NA, 粪_粪转铁蛋白正常),
         尿_红细胞血红蛋白 = ifelse(尿_红细胞血红蛋白数据缺失 == 1, NA, 尿_红细胞血红蛋白正常)
  )

# Creating a copy of the dataframe and removing specific columns
df_1 <- df %>%
  select(-尿_白细胞正常, -尿_白细胞异常, -尿_白细胞数据缺失,
         -尿_亚硝酸盐正常, -尿_亚硝酸盐异常, -尿_亚硝酸盐数据缺失,
         -尿_蛋白质正常, -尿_蛋白质异常, -尿_蛋白质数据缺失,
         -尿_酮体正常, -尿_酮体异常, -尿_酮体数据缺失,
         -尿_尿胆原正常, -尿_尿胆原异常, -尿_尿胆原数据缺失,
         -尿_胆红素正常, -尿_胆红素异常, -尿_胆红素数据缺失,
         -粪_粪粘度正常, -粪_粪粘度异常, -粪_粪粘度数据缺失,
         -粪_粪血液正常, -粪_粪血液异常, -粪_粪血液数据缺失,
         -粪_粪不消化食物正常, -粪_粪不消化食物异常, -粪_粪不消化食物数据缺失,
         -粪_粪红细胞正常, -粪_粪红细胞异常, -粪_粪红细胞数据缺失,
         -粪_粪白细胞正常, -粪_粪白细胞异常, -粪_粪白细胞数据缺失,
         -粪_粪巨噬细胞正常, -粪_粪巨噬细胞异常, -粪_粪巨噬细胞数据缺失,
         -粪_粪硬度正常, -粪_粪硬度异常, -粪_粪硬度数据缺失,
         -粪_粪颜色正常, -粪_粪颜色异常, -粪_粪颜色数据缺失,
         -粪_粪隐血正常, -粪_粪隐血异常, -粪_粪隐血数据缺失,
         -粪_粪转铁蛋白正常, -粪_粪转铁蛋白异常, -粪_粪转铁蛋白数据缺失,
         -尿_红细胞血红蛋白正常, -尿_红细胞血红蛋白异常, -尿_红细胞血红蛋白数据缺失,
        
  )

# Writing the processed data to a new Excel file
output_path <- './data/Bigdata/unscaled_data.xlsx'
write_xlsx(df_1, output_path)
